0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// Field Dictionary

FoamFile
{
    version         2.0;
    format          ascii;
    class           volVectorField;
    object          U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.991893515721708 0.0530245553421188 0);

boundaryField
{

    wing 
    {
        type            slip;
    }
    
    symmetry
    {
        type            symmetryPlane;
    }
    
    lateral
    {
        type            zeroGradient;
    }
    
    top
    {
        type            zeroGradient;
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    bottom
    {
        type            fixedValue;
        value           uniform (0.991893515721708 0.0530245553421188 0);
    }
    
    inlet
    {
        type            fixedValue;
        value           uniform (0.991893515721708 0.0530245553421188 0);
    }
    
}


// ************************************************************************* //
